from datetime import date, datetime

import pytest


@pytest.fixture
def cleaned_name_list() -> list[str]:
    """
    Фикстура со списком имен
    :return: список имен
    """
    return [
        "Иван",
        "Джон",
        "Анна",
        "Мэри",
        "Сергей",
        "Emily",
        "Kate",
        "Peter",
        "Michael",
        "Николай",
        "Alice",
        "Sophia",
        "Борис",
        "David",
        "Elizabeth",
        "Кристина",
        "Джеймс",
        "Мария",
        "Анастасия",
        "Thomas",
        "Alexandra",
        "Алексей",
        "Robert",
        "Olivia",
        "Ольга",
        "Daniel",
        "Emma",
        "Татьяна",
        "Richard",
        "William",
        "Светлана",
        "John",
        "Jessica",
        "Максим",
        "Catherine",
        "Томас",
        "Lily",
        "Марина",
        "Christopher",
        "Marie",
        "Владимир",
        "Benjamin",
        "Hannah",
        "Наталья",
        "София",
        "Александр",
        "Jacob",
        "Олег",
        "Андрей",
        "Артем",
        "Mia",
        "Илья",
        "Noah",
        "Елена",
        "Александра",
        "Алиса",
        "Алена",
        "Альберт",
        "Инга",
        "Маргарита",
        "Карина",
        "Елена",
        "Артур",
        "Софья",
        "Матвей",
        "Максим",
        "Андреа",
        "Елизавета",
        "Сергей",
        "Дмитрий",
        "Любовь",
        "Михаил",
        "Екатерина",
        "Виктория",
        "Евгения",
        "Анастасия",
        "Евгений",
        "Anthony",
        "Джон",
        "Антон",
        "Лариса",
        "Владислав",
        "Арсений",
        "Мирослава",
        "Тимофей",
        "Маргарита",
        "Лилия",
        "Софи",
        "Тимур",
        "Алёна",
        "Elena",
        "Марина",
        "Юлия",
        "Зинаида",
        "Юрий",
        "Patrick",
        "Сабина",
        "Анжелика",
        "София",
        "Ирина",
        "Даниил",
        "Адам",
        "Алина",
        "Анастасия",
        "Виктор",
    ]


@pytest.fixture
def eng_name_list() -> list[str]:
    """
    Фикстура со списком имен на английском
    :return: список имен
    """
    return [
        "Emily",
        "Kate",
        "Peter",
        "Michael",
        "Alice",
        "Sophia",
        "David",
        "Elizabeth",
        "Thomas",
        "Alexandra",
        "Robert",
        "Olivia",
        "Daniel",
        "Emma",
        "Richard",
        "William",
        "John",
        "Jessica",
        "Catherine",
        "Lily",
        "Christopher",
        "Marie",
        "Benjamin",
        "Hannah",
        "Jacob",
        "Mia",
        "Noah",
        "Anthony",
        "Elena",
        "Patrick",
    ]


@pytest.fixture
def rus_name_list() -> list[str]:
    """
    Фикстура со списком имен на русском
    :return: список имен
    """
    return [
        "Иван",
        "Джон",
        "Анна",
        "Мэри",
        "Сергей",
        "Николай",
        "Борис",
        "Кристина",
        "Джеймс",
        "Мария",
        "Анастасия",
        "Алексей",
        "Ольга",
        "Татьяна",
        "Светлана",
        "Максим",
        "Томас",
        "Марина",
        "Владимир",
        "Наталья",
        "София",
        "Александр",
        "Олег",
        "Андрей",
        "Артем",
        "Илья",
        "Елена",
        "Александра",
        "Алиса",
        "Алена",
        "Альберт",
        "Инга",
        "Маргарита",
        "Карина",
        "Елена",
        "Артур",
        "Софья",
        "Матвей",
        "Максим",
        "Андреа",
        "Елизавета",
        "Сергей",
        "Дмитрий",
        "Любовь",
        "Михаил",
        "Екатерина",
        "Виктория",
        "Евгения",
        "Анастасия",
        "Евгений",
        "Джон",
        "Антон",
        "Лариса",
        "Владислав",
        "Арсений",
        "Мирослава",
        "Тимофей",
        "Маргарита",
        "Лилия",
        "Софи",
        "Тимур",
        "Алёна",
        "Марина",
        "Юлия",
        "Зинаида",
        "Юрий",
        "Сабина",
        "Анжелика",
        "София",
        "Ирина",
        "Даниил",
        "Адам",
        "Алина",
        "Анастасия",
        "Виктор",
    ]


@pytest.fixture
def eng_data_file() -> str:
    """
    Фикстура содержимого файла с именами на английском
    :return: список имен
    """
    return """Emily
Kate
Peter
Michael
Alice
Sophia
David
Elizabeth
Thomas
Alexandra
Robert
Olivia
Daniel
Emma
Richard
William
John
Jessica
Catherine
Lily
Christopher
Marie
Benjamin
Hannah
Jacob
Mia
Noah
Anthony
Elena
Patrick
"""


@pytest.fixture
def rus_data_file() -> str:
    """
    Фикстура содержимого файла с именами на русском
    :return: список имен
    """
    return """Иван
Джон
Анна
Мэри
Сергей
Николай
Борис
Кристина
Джеймс
Мария
Анастасия
Алексей
Ольга
Татьяна
Светлана
Максим
Томас
Марина
Владимир
Наталья
София
Александр
Олег
Андрей
Артем
Илья
Елена
Александра
Алиса
Алена
Альберт
Инга
Маргарита
Карина
Елена
Артур
Софья
Матвей
Максим
Андреа
Елизавета
Сергей
Дмитрий
Любовь
Михаил
Екатерина
Виктория
Евгения
Анастасия
Евгений
Джон
Антон
Лариса
Владислав
Арсений
Мирослава
Тимофей
Маргарита
Лилия
Софи
Тимур
Алёна
Марина
Юлия
Зинаида
Юрий
Сабина
Анжелика
София
Ирина
Даниил
Адам
Алина
Анастасия
Виктор
"""


@pytest.fixture
def new_date_time() -> str:
    """
    Фикстура текущих даты и временив формате 2024-03-11T02:26:18.671407
    :return: строка в формате 2024-03-11T02:26:18.671407
    """
    return str(datetime.now())


@pytest.fixture
def new_date_str() -> str:
    """
    Фикстура текущей даты в формате ДД.ММ.ГГГГ (11.03.2024)
    :return: строка в формате ДД.ММ.ГГГГ (11.03.2024)
    """
    today = date.today()
    return today.strftime("%d.%m.%Y")
